# BuiltInFailures.AssemblyFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures Class
BuiltInFailures Class Members See Also
---
Failures related to Assemblies.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class AssemblyFailures
```

Visual Basic
---
```text
Public NotInheritable Class AssemblyFailures
```

Visual C++
---
```text
public ref class AssemblyFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..AssemblyFailures
# See Also
BuiltInFailures..::..AssemblyFailures Members
Autodesk.Revit.DB Namespace